# Чамкина Александра R3135 ISU-334638

import csv

# Изображение флага - Бенин
#-----------------------------------------------------------------------------------------------------------------------

print("\033[42m{}\033[0m".format("   "), "\033[43m{}\033[0m".format("      "), sep='')
print("\033[42m{}\033[0m".format("   "), "\033[41m{}\033[0m".format("      "), sep='')

# Вывод узора - h
#-----------------------------------------------------------------------------------------------------------------------

count = int(input("Введите количество элементов узора - ")) # количество элементов узора
quality = int(input("Введите размер элемента узора - ")) # разрешение узора

for q in range(1, quality//2): # цикл отвечающий за вывод верхней половины элемента узора
    for c in range(0, count): # цикл позволяющий выводить несколько раз верхнюю часть узора
        print("  " * ((quality // 2) - q), "\033[40m{}\033[0m".format("  " * q * 2), "  " * ((quality // 2) - q), sep="", end="")
    print("") # это необходимо для разделений уровней узора на строки

for q in range(quality//2, 0, -1): # цикл отвечающий за вывод нижней половины элемента узора
    for c in range(0, count): # цикл позволяющий выводить несколько раз нижнюю часть узора
        print("  " * ((quality//2) - q), "\033[40m{}\033[0m".format("  " * q * 2), "  " * ((quality//2) - q), sep="", end="")
    print("")

# График функции - y = x + 1
#-----------------------------------------------------------------------------------------------------------------------

qg = int(input("Введите размер графика - ")) # qg - quality for graph
graph = [["\x20" for j in range(qg)] for i in range(qg)] # Создания массива для записи всех элементов

for i in range(qg): # Запись осей
    graph[qg // 2][i] = "-"
    graph[i][qg // 2] = "|"
    graph[qg // 2][qg - 1] = ">"
    graph[0][qg // 2] = "^"

for x in range(qg): # Запись самого графика
    y = x + 1
    if y < qg:
        graph[-y][x] = "*"

for i in range(qg): # Вывод
    print("".join(e for e in graph[i]))

# Диаграмма
#-----------------------------------------------------------------------------------------------------------------------

with open("books.csv") as text:
    file = csv.reader(text, delimiter = ";")
    N = 0
    expensive = 0
    cheap = 0
    for row in file:
        if N != 0:
            if float(row[7]) < 150:  cheap += 1
            else: expensive += 1
        N += 1

pe = expensive/((cheap + expensive)/100)
pch = cheap/((cheap + expensive)/100)

print("\033[41m{}\033[0m".format(" " *round(pe)), " ",  round(pe), "% - книги дороже 150 рублей", sep="")
print("\033[42m{}\033[0m".format(" " *round(pch)), " ", round(pch), "% - книги дешевле 150 рублей", sep="")
